Repository: TheBonnec/Algo-Crypto
Catalog: Algo Crypto/Ressources/*.lproj/Localizable.strings
Languages: fr

source: Save and Reset
fr: Sauvegarder et Réinitialiser

source: Reset
fr: Réinitialiser

source: Clean
fr: Nettoyer

source: Saved Calculations
fr: Calculs Sauvegardés

source: Chapter 1
fr: Chapitre 1

source: Chapter 2
fr: Chapitre 2

source: Chapter 3
fr: Chapitre 3

source: Chapter 4
fr: Chapitre 4

# InputError
source: Incorrect input values
fr: Valeurs entrées incorrectes

# TheVoid
source: No, really. Nothing.
fr: Non ! Rien de rien !

# NoCalculation
source: No calculation saved. Nothing. Nada. Ничего нет.
fr: Aucun calcul sauvegardé. Rien. Nada. Ничего нет.

source: No Solution
fr: Aucune Solution

source: Update
fr: Mise à Jour

# LastGitHubVersion
source: Last version on GitHub
fr: Dernière version sur GitHub

# EuclidAlgo
source: Euclidean Algorithm - GCD
fr: Algorithme d'Euclide - PGCD

source: GCD
fr: PGCD

source: gcd
fr: pgcd

# ExtendedEuclidAlgo
source: Extended Euclidean Algorithm
fr: Algorithme Étendu d'Euclide

source: Equivalence Class
fr: Classe d'Équivalence

source: in
fr: dans

# AdditionInZ
source: Addition in Z/nZ
fr: Addition dans Z/nZ

# MultiplicationInZ
source: Multiplication in Z/nZ
fr: Multiplication dans Z/nZ

# InvertibleElementsInZ
source: Invertible Elements in Z/nZ
fr: Éléments Inversables dans Z/nZ

# InvertibleIn
source: Invertible elements in
fr: Éléments inversables dans

source: Invertible Elements
fr: Éléments Inversables

# LinearEquationInZ
source: Linear Equation in Z/nZ
fr: Équation Linéaire dans Z/nZ

source: For
fr: Pour

# canTakeValue
source: can take the following values:
fr: peut prendre les valeurs suivantes :

# InverseInZ
source: Inverse in Z/nZ
fr: Inverse dans Z/nZ

source: Inverse of
fr: Inverse de
